#### Stone Members

---

|  |
| --- |
| Stone Class   Properties   See Also |

The  Stone  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | CommonTintColor | The property labeled "Tint Color" from the "Stone" schema. |
| Public property Static member | CommonTintToggle | The property labeled "Tint" from the "Stone" schema. |
| Public property Static member | StoneApplication | The property labeled "Finish" from the "Stone" schema. |
| Public property Static member | StoneBump | The property labeled "Type" from the "Stone" schema. |
| Public property Static member | StoneBumpAmount | The property labeled "Amount" from the "Stone" schema. |
| Public property Static member | StoneBumpMap | The property labeled "Image" from the "Stone" schema. |
| Public property Static member | StoneColor | The property labeled "Image" from the "Stone" schema. |
| Public property Static member | StonePattern | The property labeled "Relief Pattern" from the "Stone" schema. |
| Public property Static member | StonePatternAmount | The property labeled "Amount" from the "Stone" schema. |
| Public property Static member | StonePatternMap | The property labeled "Image" from the "Stone" schema. |

# See Also

Stone Class

Autodesk.Revit.DB.Visual Namespace